In [3]:
import pandas as pd

In [4]:
#Creación de un df mediante un diccionario y listas internas
data = {

    #Habrá 3 columnas con 4 registros
    'Nombre':['Ana','Luis','Alberto','Pedro'],
    'Edad':[23,12,32,36],
    'Ciudad':['CABA','CABA','Córdoba','Posadas']
    
}


df = pd.DataFrame(data)#Convert el diccionario el DF
df#Impresión del df

    Nombre  Edad   Ciudad
0      Ana    23     CABA
1     Luis    12     CABA
2  Alberto    32  Córdoba
3    Pedro    36  Posadas

In [7]:
#Agregamos una nueva serie-columna al df...
df['Salario'] = [20000,32000,1000000,200000]#La llamamos salario y le metemos los datos para cada registro
df#Impresion

    Nombre  Edad   Ciudad  Salario
0      Ana    23     CABA    20000
1     Luis    12     CABA    32000
2  Alberto    32  Córdoba  1000000
3    Pedro    36  Posadas   200000

In [9]:
df['Salario'] = df['Salario'] + 20000#Acá estamos modif los registros de salrios de la serie original del df, pq le estamos sumando 20mil a todos los salarios que hay 
df

    Nombre  Edad   Ciudad  Salario
0      Ana    23     CABA    40000
1     Luis    12     CABA    52000
2  Alberto    32  Córdoba  1020000
3    Pedro    36  Posadas   220000

In [15]:
#Almacenamiento de la serie salario en una variable
nombres = df['Salario']
nombres#Impresión

0      40000
1      52000
2    1020000
3     220000
Name: Salario, dtype: int64

In [17]:
#Filtración de edad
condicion = df[df['Edad'] > 25]#Nos metemos en el df(df[]) 1ero y dps nos metemos en la serie-columna edad(df[df['Edad']]) y dentro de ahí aplicamos el condicional(df[df['Edad']>25]), el cual es que nos filtre las edades > a 25. Y todo esto lo almacenamos dentro de una variable
condicion#Impresión del df filtrado

    Nombre  Edad   Ciudad  Salario
2  Alberto    32  Córdoba  1020000
3    Pedro    36  Posadas   220000

Esto lo escirb para resolv una posible duda que tenga cuando lo mire en alguna otra ocasión y es básicamente pq aca solo accedo a la serie sin necesidad de ir al df primero:nombres = df['Salario'] y pq aca debo acceder al df y dps a la serie:#Filtración de edad
condicion = df[df['Edad'] > 25]. Bueno, básicmanete esto ocurre pq en el primero solo estoy accediendo directamente a la columna y el result será una serie pq solo extraigo los val de esas columna. Ahora en el 2do, estoy filtrando segun la cond y el result que me dara sera un DF pq estoy selccionando varias filas y columnas

In [23]:
#Filtración de edad, igual result que el de arriba pero hecho de otra forma
edades = df['Edad']#Guardamos la serie en una variable
condicion = df[edades > 25]#Es lo mismo que el anterior unicamnete que quizá mas simple, ya que solo nos metemos al df y metemos la variable edades(la cual dentro de ella está la serie edad) y le aplicamos el condicional > 25  
condicion#Impresión del df filtrado

    Nombre  Edad   Ciudad  Salario
2  Alberto    32  Córdoba  1020000
3    Pedro    36  Posadas   220000

In [25]:
type(edades)

pandas.core.series.Series

In [27]:
type(condicion)

pandas.core.frame.DataFrame